LoadTest/MultiProcess/school2_lec_4_students_chat.txt
Started phase 0, duration: 50s @ 03:16:09(+0530) 2021-08-08
Report @ 03:16:19(+0530) 2021-08-08
Elapsed time: 14 seconds
  Scenarios launched:  9
  Scenarios completed: 0
  Requests completed:  42
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 0.7
    median: 0.1
    p95: 0.5
    p99: 0.7
  Codes:
    0: 42
  engine.socketio.emit: 42

Report @ 03:16:29(+0530) 2021-08-08
Elapsed time: 24 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  51
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 1.8
    median: 0
    p95: 0.5
    p99: 1.8
  Codes:
    0: 51
  engine.socketio.emit: 51

Report @ 03:16:39(+0530) 2021-08-08
Elapsed time: 34 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  59
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 1.2
    median: 0.1
    p95: 0.4
    p99: 1.2
  Codes:
    0: 59
  engine.socketio.emit: 59

Report @ 03:16:49(+0530) 2021-08-08
Elapsed time: 44 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  68
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 1.6
    median: 0.1
    p95: 0.5
    p99: 1.4
  Codes:
    0: 68
  engine.socketio.emit: 68

Report @ 03:16:59(+0530) 2021-08-08
Elapsed time: 54 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  75
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 0.9
    median: 0.2
    p95: 0.5
    p99: 0.8
  Codes:
    0: 75
  engine.socketio.emit: 75

Report @ 03:17:09(+0530) 2021-08-08
Elapsed time: 1 minute, 4 seconds
  Scenarios launched:  1
  Scenarios completed: 0
  Requests completed:  39
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 1.9
    median: 0.3
    p95: 1.4
    p99: 1.9
  Codes:
    0: 39
  engine.socketio.emit: 39

Report @ 03:17:19(+0530) 2021-08-08
Elapsed time: 1 minute, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.6
    median: 0.3
    p95: 0.6
    p99: 0.6
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:17:29(+0530) 2021-08-08
Elapsed time: 1 minute, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.7
    median: 0.3
    p95: 0.7
    p99: 2.7
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:17:39(+0530) 2021-08-08
Elapsed time: 1 minute, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.6
    median: 0.4
    p95: 0.6
    p99: 2.6
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:17:49(+0530) 2021-08-08
Elapsed time: 1 minute, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 1.2
    median: 0.4
    p95: 0.6
    p99: 1.2
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:17:59(+0530) 2021-08-08
Elapsed time: 1 minute, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.7
    median: 0.3
    p95: 0.6
    p99: 0.7
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:18:09(+0530) 2021-08-08
Elapsed time: 2 minutes, 4 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1.4
    median: 0.3
    p95: 0.8
    p99: 1.4
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:18:19(+0530) 2021-08-08
Elapsed time: 2 minutes, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.7
    median: 0.3
    p95: 0.8
    p99: 2.7
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:18:29(+0530) 2021-08-08
Elapsed time: 2 minutes, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 2.3
    median: 0.4
    p95: 0.8
    p99: 2.3
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:18:39(+0530) 2021-08-08
Elapsed time: 2 minutes, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1
    median: 0.3
    p95: 0.6
    p99: 1
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:18:49(+0530) 2021-08-08
Elapsed time: 2 minutes, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.8
    median: 0.3
    p95: 0.7
    p99: 0.8
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:18:59(+0530) 2021-08-08
Elapsed time: 2 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.3
    median: 0.3
    p95: 0.7
    p99: 2.3
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:19:09(+0530) 2021-08-08
Elapsed time: 3 minutes, 4 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.8
    median: 0.3
    p95: 0.7
    p99: 0.8
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:19:19(+0530) 2021-08-08
Elapsed time: 3 minutes, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.6
    median: 0.2
    p95: 0.6
    p99: 0.6
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:19:29(+0530) 2021-08-08
Elapsed time: 3 minutes, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.7
    median: 0.3
    p95: 0.6
    p99: 0.7
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:19:39(+0530) 2021-08-08
Elapsed time: 3 minutes, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.9
    median: 0.3
    p95: 0.8
    p99: 2.9
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:19:49(+0530) 2021-08-08
Elapsed time: 3 minutes, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 4.2
    median: 0.2
    p95: 0.5
    p99: 4.2
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:19:59(+0530) 2021-08-08
Elapsed time: 3 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.5
    median: 0.2
    p95: 0.5
    p99: 0.5
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:20:09(+0530) 2021-08-08
Elapsed time: 4 minutes, 4 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1.5
    median: 0.3
    p95: 0.8
    p99: 1.5
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:20:19(+0530) 2021-08-08
Elapsed time: 4 minutes, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.4
    median: 0.3
    p95: 0.9
    p99: 2.4
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:20:29(+0530) 2021-08-08
Elapsed time: 4 minutes, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.7
    median: 0.2
    p95: 0.5
    p99: 0.7
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:20:39(+0530) 2021-08-08
Elapsed time: 4 minutes, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.7
    median: 0.3
    p95: 0.6
    p99: 2.7
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:20:49(+0530) 2021-08-08
Elapsed time: 4 minutes, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.4
    median: 0.3
    p95: 0.9
    p99: 2.4
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:20:59(+0530) 2021-08-08
Elapsed time: 4 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.7
    median: 0.3
    p95: 0.5
    p99: 2.7
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:21:09(+0530) 2021-08-08
Elapsed time: 5 minutes, 4 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  35
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.9
    median: 0.3
    p95: 0.8
    p99: 0.9
  Codes:
    0: 35
  engine.socketio.emit: 35

Report @ 03:21:19(+0530) 2021-08-08
Elapsed time: 5 minutes, 14 seconds
  Scenarios launched:  0
  Scenarios completed: 9
  Requests completed:  29
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.8
    median: 0.2
    p95: 0.6
    p99: 0.8
  Codes:
    0: 29
  engine.socketio.emit: 29

Report @ 03:21:29(+0530) 2021-08-08
Elapsed time: 5 minutes, 24 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  24
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.4
    median: 0.2
    p95: 1.6
    p99: 2.4
  Codes:
    0: 24
  engine.socketio.emit: 24

Report @ 03:21:39(+0530) 2021-08-08
Elapsed time: 5 minutes, 34 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  16
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.5
    median: 0.4
    p95: 0.5
    p99: 0.5
  Codes:
    0: 16
  engine.socketio.emit: 16

Report @ 03:21:49(+0530) 2021-08-08
Elapsed time: 5 minutes, 44 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  7
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 0.8
    median: 0.3
    p95: 0.8
    p99: 0.8
  Codes:
    0: 7
  engine.socketio.emit: 7

Report @ 03:21:59(+0530) 2021-08-08
Elapsed time: 5 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 03:21:59(+0530) 2021-08-08
Elapsed time: 5 minutes, 54 seconds
  Scenarios launched:  0
  Scenarios completed: 1
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

All virtual users finished
Summary report @ 03:21:59(+0530) 2021-08-08
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  1250
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 4.2
    median: 0.3
    p95: 0.6
    p99: 1.9
  Scenario counts:
    Students with lecture doubts: 35 (70%)
    Silent students: 15 (30%)
  Codes:
    0: 1250
  engine.socketio.emit: 1250